# IsEmpty Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Categories..::..IsEmpty Property
Categories Class See Also
---
Whether or not the list of top-level categories is empty.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override bool IsEmpty { get; }
```

Visual Basic
---
```text
Public Overrides ReadOnly Property IsEmpty As Boolean
	Get
```

Visual C++
---
```text
public:
virtual property bool IsEmpty {
	bool get () override;
}
```

# See Also
Categories Class
Autodesk.Revit.DB Namespace